#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СвойстваДолжностейГосударственнойСлужбы";
	ПараметрыОбновления.ИдентификаторИсточника = "ГосСлужба";
	ПараметрыОбновления.ИмяОбъекта = "Должность";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = Справочники.Должности.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();
	
	НастройкиПрограммы = ЗарплатаКадрыРасширенный.НастройкиПрограммыБюджетногоУчреждения();
	Если НастройкиПрограммы.ИспользоватьГосударственнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ГруппаДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("КатегорияДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПрокурора");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьМуниципальнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ГруппаДолжностиГосударственнойСлужбы");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПомощникаЗамещающегоМуниципальнуюДолжность");
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьПрокурора");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьВоеннуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ВидДолжностиГосударственнойСлужбы");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьРасчетДенежногоСодержанияСудей Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ДолжностьСудьи");
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыОбновления.Реквизиты);
	
	Если ПараметрыОбновления.Реквизиты.Количество() = 0 Тогда
		ПараметрыОбновления.ИспользоватьХарактеристики = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли