
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВладелецФормы = ПараметрыВыполненияКоманды.Источник;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Объект", ПараметрКоманды);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Объект", ПараметрКоманды));
	
	ОткрытьФорму("РегистрСведений.ХарактеристикиОбъектовПоМедРегистру.Форма.РедактированиеХарактеристикОбъекта",
		ПараметрыОткрытия, 
		ВладелецФормы, 
		ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры
