#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СвойстваНачисленийГосударственныхСлужащих";
	ПараметрыОбновления.ИдентификаторИсточника = "ГосСлужба";
	ПараметрыОбновления.ИмяОбъекта = "Начисление";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = ПланыВидовРасчета.Начисления.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();

	НастройкиПрограммы = ЗарплатаКадрыРасширенный.НастройкиПрограммыБюджетногоУчреждения();
	Если НастройкиПрограммы.ИспользоватьГосударственнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымСодержанием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуСодержанию");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьМуниципальнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымСодержанием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуСодержанию");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьРасчетСохраняемогоДенежногоСодержания Тогда
		ПараметрыОбновления.Реквизиты.Добавить("УчетПриРасчетеОтпуска");
		ПараметрыОбновления.Реквизиты.Добавить("УчетПриРасчетеСохраняемогоДенежногоСодержания");
		ПараметрыОбновления.Реквизиты.Добавить("УчетВКомпенсацииПриУвольнении");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьВоеннуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымДовольствием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуДовольствию");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыОбновления.Реквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли