#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ЗарплатаКадрыВызовСервера.ПредставленияОснованийУвольненияОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыВызовСервера.ПредставленияОснованийУвольненияОбработкаПолученияДанныхВыбора("ОснованияУвольненияСГосударственнойСлужбы", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение справочника.
//
Процедура НачальноеЗаполнение() Экспорт
	
	ИмяСправочника = Метаданные.Справочники.ОснованияУвольненияСГосударственнойСлужбы.Имя;
	ИмяМакета = ИмяМакетаКлассификатора();
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Наименование", "Title");
	СоответствиеПолей.Вставить("ТекстОснования", "Reason");
	
	КлючиПоиска = Новый Структура;
	КлючиПоиска.Вставить("КлючиПоискаСправочника", "Наименование");
	КлючиПоиска.Вставить("КлючиПоискаМакета", "Title");
	
	КонтрактыДоговорыСотрудников.ЗаполнитьСправочникИзМакетаКлассификатора(ИмяСправочника, ИмяМакета, СоответствиеПолей, КлючиПоиска);
	
КонецПроцедуры

// Процедура обновляет наименования статей из классификатора. 
// Поиск элемента производится по реквизиту ТекстОснования.
//
Процедура ОбновитьНаименованияИзКлассификатора() Экспорт 
	
	ИмяСправочника = Метаданные.Справочники.ОснованияУвольненияСГосударственнойСлужбы.Имя;
	ИмяМакета = ИмяМакетаКлассификатора();
	ИмяРеквизитаПоиска = "ТекстОснования";
	ИмяПоляЗначенияПоиска = "Reason";
	
	ОбновляемыеПоля = Новый Соответствие;
	ОбновляемыеПоля.Вставить("Наименование", "Title");
	
	КонтрактыДоговорыСотрудников.ОбновитьПоляСправочникаИзМакетаКлассификатора(ИмяСправочника, ИмяМакета, ИмяРеквизитаПоиска, ИмяПоляЗначенияПоиска, ОбновляемыеПоля);
		
КонецПроцедуры

Функция ИмяМакетаКлассификатора()
	Возврат "ОснованияУвольненияСГосударственнойСлужбы";
КонецФункции

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьСправочникИзКлассификатора() Экспорт
	
	НачальноеЗаполнение();

КонецПроцедуры

#КонецОбласти

#КонецЕсли