#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует табличный документ отчет.
//
// Параметры:
//  ТаблицаОтчета 	- ТабличныйДокумент - документ, в который выводятся данные.
//  Организация  	- СправочникСсылка.Организации - Организация, по которой формируется отчет.
//  ДатаНачала		- Дата - дата начала периода.
//  ДатаОкончания	- Дата - дата конца периода.
//
Процедура СформироватьОтчет(ТаблицаОтчета,Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	ТаблицаОтчета.Очистить();
			
	СформироватьОтчетФорма14(ТаблицаОтчета, Организация, ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРаздел(ТабДокРезультат, ВыборкаСтрок, ТекущийРаздел, ТочностьПоказателей, Макет) Экспорт
	
	ТочностьВ10 = Pow(10, ТочностьПоказателей);
	БоковикПоказатели = Макет.ПолучитьОбласть("Раздел_"+ТекущийРаздел+"|Боковик");
	ОбластьПоказатели = Макет.ПолучитьОбласть("Раздел_"+ТекущийРаздел+"|Всего");
	БоковикШапка	  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|Бюдж");
	ШапкаАналитики	  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|ПоРазделам");
	ШапкаВсего		  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|ВСего");
	Шапка		  = Макет.ПолучитьОбласть("Шапка_"+ТекущийРаздел);
	
	ТабДокРезультат.Вывести(Шапка);
	
	ТабДокументШапка      = Новый ТабличныйДокумент;
	ДетальныеПоказатели   = Новый ТабличныйДокумент;
	
	ТабДокументШапка.Вывести(БоковикШапка);
	
	ИтогоСтруктураПараметров = ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели);
	СтруктураПараметровЗнач = ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели);

    Если ВыборкаСтрок <> Неопределено Тогда
		Пока ВыборкаСтрок.Следующий() Цикл //Цикл по разделам отчета
			
			ЗаполнитьЗначенияСвойств(СтруктураПараметровЗнач, ВыборкаСтрок);
			Для каждого Параметр Из ИтогоСтруктураПараметров Цикл
				СтруктураПараметровЗнач[Параметр.Ключ]  = ?(СтруктураПараметровЗнач[Параметр.Ключ] = NULL, 0, СтруктураПараметровЗнач[Параметр.Ключ])/ТочностьВ10;
				ИтогоСтруктураПараметров[Параметр.Ключ] = ИтогоСтруктураПараметров[Параметр.Ключ] + СтруктураПараметровЗнач[Параметр.Ключ];
			КонецЦикла;
			ШапкаАналитики.Параметры.Заполнить(ВыборкаСтрок);
			ТабДокументШапка.Присоединить(ШапкаАналитики);
			
		КонецЦикла;
	КонецЕсли;
			
	ТабДокРезультат.Вывести(ТабДокументШапка);
	ТабДокРезультат.Вывести(БоковикПоказатели);
	ОбластьПоказатели.Параметры.Заполнить(ИтогоСтруктураПараметров);
	ТабДокРезультат.Присоединить(ОбластьПоказатели);
	
    Если ВыборкаСтрок <> Неопределено Тогда
		ВыборкаСтрок.Сбросить();
		Пока ВыборкаСтрок.Следующий() Цикл //Цикл по разделам отчета
			
			ЗаполнитьЗначенияСвойств(СтруктураПараметровЗнач, ВыборкаСтрок);
			Для каждого Параметр Из ИтогоСтруктураПараметров Цикл
				СтруктураПараметровЗнач[Параметр.Ключ]  = СтруктураПараметровЗнач[Параметр.Ключ]/ТочностьВ10;
			КонецЦикла;
			ОбластьПоказатели.Параметры.Заполнить(СтруктураПараметровЗнач);
			ТабДокРезультат.Присоединить(ОбластьПоказатели);
			
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели)
	СтруктураПоказателей = Новый Структура;
	Для НомерСтроки = 1 По ОбластьПоказатели.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ОбластьПоказатели.ШиринаТаблицы Цикл
			Ячейка = ОбластьПоказатели.Область(НомерСтроки,НомерКолонки,НомерСтроки,НомерКолонки);
			Если Ячейка.Параметр <> "" И Ячейка.Параметр <> Неопределено Тогда
				Если НЕ СтруктураПоказателей.Свойство(Ячейка.Параметр) Тогда
					СтруктураПоказателей.Вставить(Ячейка.Параметр, 0);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат СтруктураПоказателей;
КонецФункции

Функция ДатаПереходаНа179н() Экспорт
	Возврат КонецГода('20101231235959')
КонецФункции

Функция ДатаПереходаНа143н() Экспорт
	Возврат КонецГода('20141231235959')
КонецФункции

Функция ДатаПереходаНа86н() Экспорт
	Возврат Дата(2016,1,1)
КонецФункции

Функция ДатаПереходаНа259н() Экспорт
	Возврат Дата(2017,1,1)
КонецФункции

Функция ПолучитьДанныеПоФорме14_Расходы(Организация, ДатаНачала, ДатаОкончания) экспорт
	
	СтруктураДанных = Новый Структура("Расходы, Справка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация 		= Организация;
	ПараметрыПолученияСотрудников.НачалоПериода 	= ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= ДатаОкончания;
			
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
			Запрос.МенеджерВременныхТаблиц, Истина, 
			ПараметрыПолученияСотрудников, 
			"ВТСотрудникиОрганизации");
			
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
	КадровыеДанные = "ВидДоговора";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);			
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
		
	// начисления, которые показываются в отчетах в составе других начислений
	МассивВРДляРаспределения = Новый Массив;
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеРайонныйКоэффициент());
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеСевернаяНадбавка());
	Запрос.УстановитьПараметр("МассивВРДляРаспределения", МассивВРДляРаспределения);
	
	МассивВидыДоговоров = Новый Массив;
	МассивВидыДоговоров.Добавить(Перечисления.ВидыДоговоровССотрудниками.КонтрактГосслужащего);
	МассивВидыДоговоров.Добавить(Перечисления.ВидыДоговоровССотрудниками.КонтрактВоеннослужащего);
	Запрос.УстановитьПараметр("МассивВидыДоговоров", МассивВидыДоговоров);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("парамИзмерения", Измерения);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	Разрезы.Добавить("ВидРасчета");
	Разрезы.Добавить("ПериодРегистрации");
	Запрос.УстановитьПараметр("парамРазрезы", Разрезы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияБазаНачисления.Сотрудник КАК Сотрудник,
	|	НачисленияБазаНачисления.ПериодРегистрацииРазрез КАК Период,
	|	НачисленияБазаНачисления.РегистраторРазрез КАК Регистратор,
	|	НачисленияБазаНачисления.ВидРасчетаРазрез КАК ВидРасчета,
	|	НачисленияБазаНачисления.РезультатБаза КАК Результат,
	|	НачисленияБазаНачисления.ПериодРегистрации КАК ПериодВР,
	|	НачисленияБазаНачисления.Регистратор КАК РегистраторВР,
	|	НачисленияБазаНачисления.ВидРасчета КАК ВидРасчетаВР,
	|	НачисленияБазаНачисления.Результат КАК РезультатВР,
	|	НачисленияБазаНачисления.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТВРДляРаспределения
	|ИЗ
	|	РегистрРасчета.Начисления.БазаНачисления(
	|			&ПарамИзмерения,
	|			&ПарамИзмерения,
	|			&ПарамРазрезы,
	|			ВидРасчета В (&МассивВРДляРаспределения)
	|				И Организация = &Организация
	|				И (ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И Результат <> 0) КАК НачисленияБазаНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО НачисленияБазаНачисления.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	КадровыеДанныеСотрудников.ВидДоговора В (&МассивВидыДоговоров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.РегистраторВР
	|ПОМЕСТИТЬ ВТСторнировавшиеДокументы
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|ГДЕ
	|	ПромежуточныеДанные.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.Сотрудник,
	|	ПромежуточныеДанные.Период,
	|	ПромежуточныеДанные.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ПромежуточныеДанные.РегистраторВР В
	|				(ВЫБРАТЬ
	|					СторнировавшиеДокументы.РегистраторВР
	|				ИЗ
	|					ВТСторнировавшиеДокументы КАК СторнировавшиеДокументы)
	|			ТОГДА ПромежуточныеДанные.РегистраторВР
	|		ИНАЧЕ ПромежуточныеДанные.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ПромежуточныеДанные.Результат,
	|	ПромежуточныеДанные.ПериодВР,
	|	ПромежуточныеДанные.РегистраторВР,
	|	ПромежуточныеДанные.ВидРасчетаВР,
	|	ПромежуточныеДанные.РезультатВР
	|ПОМЕСТИТЬ ВТБаза
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияВР.Регистратор КАК РегистраторВР,
	|	НачисленияВР.НомерСтроки КАК НомерСтрокиВР,
	|	НачисленияВР.Сумма КАК РезультатВР,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки,
	|	Начисления.Сумма КАК Результат
	|ИЗ
	|	ВТБаза КАК База
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияВР
	|		ПО (НачисленияВР.Регистратор = База.РегистраторВР)
	|			И (НачисленияВР.Период = База.ПериодВР)
	|			И (НачисленияВР.Сотрудник = База.Сотрудник)
	|			И (НачисленияВР.НачислениеУдержание = База.ВидРасчетаВР)
	|			И (НачисленияВР.Организация = &Организация)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ПО (Начисления.Регистратор = База.Регистратор)
	|			И (Начисления.Период = База.Период)
	|			И (Начисления.Сотрудник = База.Сотрудник)
	|			И (Начисления.НачислениеУдержание = База.ВидРасчета)
	|			И (Начисления.Организация = &Организация)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияВР.Регистратор,
	|	НачисленияВР.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРегистраторов = РегистрыРасчета.Начисления.СоздатьНаборЗаписей().ВыгрузитьКолонки("Регистратор");
	МассивТиповДокументов = Новый Массив;
	Для каждого ТипДокумента Из ТаблицаРегистраторов.Колонки.Регистратор.ТипЗначения.Типы() Цикл
		МассивТиповДокументов.Добавить(ТипДокумента);
	КонецЦикла;
	
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("Регистратор", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаРаспределения.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределения.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	
	ВремТаблица = ТаблицаРаспределения.СкопироватьКолонки();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РегистраторВР") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтрокиВР") Цикл
			
			СуммаКРаспределению = Выборка.РезультатВР;
			
			ВремТаблица.Очистить();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ВремТаблица.Добавить(),Выборка);
			КонецЦикла;
			
			МассивКоэффициентов = ВремТаблица.ВыгрузитьКолонку("Результат");
			МассивСуммКНачислению = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СуммаКРаспределению,МассивКоэффициентов);
			
			Если МассивСуммКНачислению <> Неопределено Тогда
				
				Для каждого СтрокаТЗ Из ВремТаблица Цикл
					
					НоваяСтрока = ТаблицаРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
					НоваяСтрока.Результат = МассивСуммКНачислению[ВремТаблица.Индекс(СтрокаТЗ)];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	ТаблицаРаспределения.Свернуть("Регистратор,НомерСтроки","Результат");
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	
	СохраняемоеДенежноеСодержание = Новый Массив;
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СохраняемоеДенежноеСодержание);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодОтпуска);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособиеМесячноеДенежноеСодержание);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДоплатаДоДенежногоСодержанияЗаДниБолезни);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодКомандировки);
	
	Запрос.УстановитьПараметр("СохраняемоеДенежноеСодержание", СохраняемоеДенежноеСодержание);
	МассивКОСГУ = Новый Массив;
	МассивКОСГУ.Добавить(ОтражениеЗарплатыВБухучетеРасширенный.СтатьяРасходов211());
	Запрос.УстановитьПараметр("КОСГУ", МассивКОСГУ);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Период КАК Период,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ДокументОснование КАК ДокументОснование,
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.НомерСтроки,
	|	Начисления.СтатьяФинансирования,
	|	Начисления.НачислениеУдержание КАК ВидРасчета,
	|	Начисления.Сумма КАК Результат
	|ПОМЕСТИТЬ ВТСохраняемоеДенежноеСодержание
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|ГДЕ
	|	Начисления.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В(&СохраняемоеДенежноеСодержание)
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И Начисления.СтатьяРасходов В(&КОСГУ)
	|	И Начисления.Организация = &Организация
	|	И Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.Сумма <> 0 
	|
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Регистратор,
	|	ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСохраняемоеДенежноеСодержание.Период,
	|	ВТСохраняемоеДенежноеСодержание.Сотрудник,
	|	ВТСохраняемоеДенежноеСодержание.ВидРасчета,
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)) КАК ОтношениеКДенежномуСодержанию,
	|	ВТСохраняемоеДенежноеСодержание.СтатьяФинансирования,
	|	ВТСохраняемоеДенежноеСодержание.Результат,
	|	ВТСохраняемоеДенежноеСодержание.Регистратор КАК Регистратор,
	|	ВТСохраняемоеДенежноеСодержание.НомерСтроки КАК НомерСтроки,
	|	СУММА(СоставСохраняемогоДенежногоСодержания.Сумма) КАК РезультатБаза
	|ИЗ
	|	ВТСохраняемоеДенежноеСодержание КАК ВТСохраняемоеДенежноеСодержание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СоставСохраняемогоДенежногоСодержания КАК СоставСохраняемогоДенежногоСодержания
	|		ПО  
	|          (ВЫБОР 
	|          	КОГДА ВТСохраняемоеДенежноеСодержание.ДокументОснование = НЕОПРЕДЕЛЕНО 
	|           	ТОГДА ВТСохраняемоеДенежноеСодержание.Регистратор
	|           ИНАЧЕ ВТСохраняемоеДенежноеСодержание.ДокументОснование
	|          КОНЕЦ = СоставСохраняемогоДенежногоСодержания.Регистратор)
	|			И (СоставСохраняемогоДенежногоСодержания.Сумма <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваНачисленийГосударственныхСлужащих КАК СвойстваНачисленийГосударственныхСлужащих
	|		ПО СвойстваНачисленийГосударственныхСлужащих.Начисление = СоставСохраняемогоДенежногоСодержания.Начисление
	|
	|ГДЕ
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)) <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСохраняемоеДенежноеСодержание.Период,
	|	ВТСохраняемоеДенежноеСодержание.Сотрудник,
	|	ВТСохраняемоеДенежноеСодержание.ВидРасчета,
	|	ВТСохраняемоеДенежноеСодержание.СтатьяФинансирования,
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)),
	|	ВТСохраняемоеДенежноеСодержание.Регистратор,
	|	ВТСохраняемоеДенежноеСодержание.Результат,
	|	ВТСохраняемоеДенежноеСодержание.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивТиповПВР = Новый Массив;
	МассивТиповПВР.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
	
	ТаблицаРаспределенияДС = Новый ТаблицаЗначений;
	ТаблицаРаспределенияДС.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаРаспределенияДС.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов(МассивТиповПВР));
	ТаблицаРаспределенияДС.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаРаспределенияДС.Колонки.Добавить("ОтношениеКДенежномуСодержанию", Новый ОписаниеТипов("ПеречислениеСсылка.ОтношениеНачисленийКДенежномуСодержанию"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Регистратор", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаРаспределенияДС.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	
	ВремТаблица = ТаблицаРаспределенияДС.СкопироватьКолонки();
	ВремТаблица.Колонки.Добавить("РезультатБаза", Новый ОписаниеТипов("Число"));
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			
			СуммаКРаспределению = Выборка.Результат;
			
			ВремТаблица.Очистить();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ВремТаблица.Добавить(),Выборка);
			КонецЦикла;
			
			МассивКоэффициентов = ВремТаблица.ВыгрузитьКолонку("РезультатБаза");
			МассивСуммКНачислению = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СуммаКРаспределению,МассивКоэффициентов);
			
			Если МассивСуммКНачислению <> Неопределено Тогда
				
				Для каждого СтрокаТЗ Из ВремТаблица Цикл
					
					НоваяСтрока = ТаблицаРаспределенияДС.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
					НоваяСтрока.Результат = МассивСуммКНачислению[ВремТаблица.Индекс(СтрокаТЗ)];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРаспределенияДС", ТаблицаРаспределенияДС);	
	
	ПараметрыПолученияРабочихМест = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияРабочихМест,ПараметрыПолученияСотрудников);
	// Получаем рабочие места сотрудников
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияРабочихМест);
			
	ВидыДолжностейОтчета = Новый Массив;
	ВидыДолжностейОтчета.Добавить("ГосударственнаяДолжность");
	ВидыДолжностейОтчета.Добавить("ДолжностьГосударственнойГражданскойСлужбы");
	ВидыДолжностейОтчета.Добавить("ОтдельнаяДолжностьГосударственнойГражданскойСлужбы");
	ВидыДолжностейОтчета.Добавить("ДолжностьИногоВидаФедеральнойГосударственнойСлужбы");
	Запрос.УстановитьПараметр("ВидыДолжностейОтчета", ВидыДолжностейОтчета);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Регистратор КАК Регистратор,
	|	ТаблицаРаспределения.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределения.Результат
	|ПОМЕСТИТЬ ВТТаблицаРаспределения
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспределенияДС.Период КАК Период,
	|	ТаблицаРаспределенияДС.Сотрудник КАК Сотрудник,
	|	ТаблицаРаспределенияДС.ВидРасчета КАК ВидРасчета,
	|	ТаблицаРаспределенияДС.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ТаблицаРаспределенияДС.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,
	|	ТаблицаРаспределенияДС.Регистратор КАК Регистратор,
	|	ТаблицаРаспределенияДС.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределенияДС.Результат
	|ПОМЕСТИТЬ ВТТаблицаРаспределенияДС
	|ИЗ
	|	&ТаблицаРаспределенияДС КАК ТаблицаРаспределенияДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Должность,
	|	ЕСТЬNULL(СтрокиОтчетностиРасходовИЧисленности.СтрокаОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов.КодКатегорииПерсонала,"""") КАК КодКатегорииПерсонала,
	|	СвойстваДолжностейГосударственнойСлужбы.КатегорияДолжностиГосударственнойСлужбы КАК КатегорияДолжностиГосударственнойСлужбы,
	|	СвойстваДолжностейГосударственнойСлужбы.ГруппаДолжностиГосударственнойСлужбы
	|ПОМЕСТИТЬ ВТДвиженияРаботников
	|ИЗ
	|	ВТРабочиеМестаСотрудников КАК РаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов КАК СтрокиОтчетностиРасходовИЧисленности
	|		ПО (СтрокиОтчетностиРасходовИЧисленности.Должность = РаботникиОрганизации.Должность)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейГосударственнойСлужбы КАК СвойстваДолжностейГосударственнойСлужбы
	|		ПО (СвойстваДолжностейГосударственнойСлужбы.Должность = РаботникиОрганизации.Должность)
	|ГДЕ
	|	РаботникиОрганизации.Организация = &Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(Начисления.Период, МЕСЯЦ) КАК Период,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.НачислениеУдержание КАК ВидРасчета,
	|	СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,
	|	СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуДовольствию КАК ОтношениеКДенежномуДовольствию,
	|	Начисления.СтатьяФинансирования,
	|	Начисления.Сумма КАК Результат,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваНачисленийГосударственныхСлужащих КАК СвойстваНачисленийГосударственныхСлужащих
	|		ПО СвойстваНачисленийГосударственныхСлужащих.Начисление = Начисления.НачислениеУдержание	
	|ГДЕ
	|	Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И Начисления.Организация = &Организация
	|	И Начисления.СтатьяРасходов В(&КОСГУ)
	|	И Начисления.Сумма <> 0
	|	И (НЕ Начисления.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&СохраняемоеДенежноеСодержание))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаРаспределенияДС.Период,
	|	ВТТаблицаРаспределенияДС.Сотрудник,
	|	ВТТаблицаРаспределенияДС.ВидРасчета,
	|	ВТТаблицаРаспределенияДС.ОтношениеКДенежномуСодержанию,
	|   ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуДовольствию.ПустаяСсылка),
	|	ВТТаблицаРаспределенияДС.СтатьяФинансирования,
	|	ВТТаблицаРаспределенияДС.Результат,
	|	ВТТаблицаРаспределенияДС.Регистратор,
	|	ВТТаблицаРаспределенияДС.НомерСтроки
	|ИЗ
	|	ВТТаблицаРаспределенияДС КАК ВТТаблицаРаспределенияДС
	|ГДЕ
	|	ВТТаблицаРаспределенияДС.Результат <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ТаблицаНачислений.Период КАК Период,
	|	МАКСИМУМ(ВТДвиженияРаботников.Период) КАК ПериодДвижения
	|ПОМЕСТИТЬ ВТДвиженияНачисления
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|			И (ВТДвиженияРаботников.Период <= ТаблицаНачислений.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаНачислений.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)) КАК КБК,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,	
	|	ТаблицаНачислений.ОтношениеКДенежномуДовольствию КАК ОтношениеКДенежномуДовольствию,	
	|	ЕСТЬNULL(ВТДвиженияРаботников.КодКатегорииПерсонала, """") КАК КодКатегорииПерсонала,
	|	ЕСТЬNULL(ВТДвиженияРаботников.КатегорияДолжностиГосударственнойСлужбы, ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ПустаяСсылка)) КАК КатегорияДолжности,
	|	ЕСТЬNULL(ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы, ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.ПустаяСсылка)) КАК ГруппаДолжности,
	|	СУММА(ТаблицаНачислений.Результат + ЕСТЬNULL(ВТТаблицаРаспределения.Результат, 0)) КАК Результат
	|ПОМЕСТИТЬ ВТДанныеУчета
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияНачисления КАК ВТДвиженияНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|			ПО ВТДвиженияНачисления.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|				И ВТДвиженияНачисления.ПериодДвижения = ВТДвиженияРаботников.Период
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияНачисления.Сотрудник
	|			И ТаблицаНачислений.Период = ВТДвиженияНачисления.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаРаспределения КАК ВТТаблицаРаспределения
	|		ПО ТаблицаНачислений.Регистратор = ВТТаблицаРаспределения.Регистратор
	|			И ТаблицаНачислений.НомерСтроки = ВТТаблицаРаспределения.НомерСтроки
	|			И (ВТДвиженияРаботников.КодКатегорииПерсонала В (&ВидыДолжностейОтчета))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТДвиженияРаботников.КодКатегорииПерсонала В (&ВидыДолжностейОтчета)
	|					И ТаблицаНачислений.ВидРасчета В (&МассивВРДляРаспределения)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию,
	|	ТаблицаНачислений.ОтношениеКДенежномуДовольствию,	
	|	ВТДвиженияРаботников.КатегорияДолжностиГосударственнойСлужбы,
	|	ВТДвиженияРаботников.КодКатегорииПерсонала,
	|	ТаблицаНачислений.СтатьяФинансирования,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчета.КБК,
	|	ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012 + ДанныеУчета.Раздел1_СТР013 КАК Раздел1_СТР010,
	|	ДанныеУчета.Раздел1_СТР011,
	|	ДанныеУчета.Раздел1_СТР012,
	|	ДанныеУчета.Раздел1_СТР013,
	|	ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР023 + ДанныеУчета.Раздел1_СТР025 КАК Раздел1_СТР020,
	|	ДанныеУчета.Раздел1_СТР021,
	|	ДанныеУчета.Раздел1_СТР022,
	|	ДанныеУчета.Раздел1_СТР023,
	|	ДанныеУчета.Раздел1_СТР024,
	|	ДанныеУчета.Раздел1_СТР025,
	|	ДанныеУчета.Раздел1_СТР031 + ДанныеУчета.Раздел1_СТР032 + ДанныеУчета.Раздел1_СТР033 КАК Раздел1_СТР030,
	|	ДанныеУчета.Раздел1_СТР031,
	|	ДанныеУчета.Раздел1_СТР032,
	|	ДанныеУчета.Раздел1_СТР033,
	|	ДанныеУчета.Раздел1_СТР041 + ДанныеУчета.Раздел1_СТР042 КАК Раздел1_СТР040,
	|	ДанныеУчета.Раздел1_СТР041,
	|	ДанныеУчета.Раздел1_СТР042,
	|	ДанныеУчета.Раздел1_СТР043,
	|	ДанныеУчета.Раздел1_СТР050,
	|	ДанныеУчета.Раздел1_СТР060,
	|	ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012 + ДанныеУчета.Раздел1_СТР013 + ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР023 + ДанныеУчета.Раздел1_СТР025 + ДанныеУчета.Раздел1_СТР031 + ДанныеУчета.Раздел1_СТР032 + ДанныеУчета.Раздел1_СТР033 + ДанныеУчета.Раздел1_СТР041 + ДанныеУчета.Раздел1_СТР042 + ДанныеУчета.Раздел1_СТР050 + ДанныеУчета.Раздел1_СТР060 КАК Раздел1_СТР070_Факт,
	|	ДанныеУчета.Раздел3_СТР411 + ДанныеУчета.Раздел3_СТР412 + ДанныеУчета.Раздел3_СТР413 КАК Раздел3_СТР410,
	|	ДанныеУчета.Раздел3_СТР411,
	|	ДанныеУчета.Раздел3_СТР412,
	|	ДанныеУчета.Раздел3_СТР413,
	|	ДанныеУчета.Раздел3_СТР421 + ДанныеУчета.Раздел3_СТР422 + ДанныеУчета.Раздел3_СТР423 КАК Раздел3_СТР420,
	|	ДанныеУчета.Раздел3_СТР421,
	|	ДанныеУчета.Раздел3_СТР422,
	|	ДанныеУчета.Раздел3_СТР423,
	|	ДанныеУчета.Раздел3_СТР431 + ДанныеУчета.Раздел3_СТР432 + ДанныеУчета.Раздел3_СТР433 + ДанныеУчета.Раздел3_СТР434 КАК Раздел3_СТР430,
	|	ДанныеУчета.Раздел3_СТР431,
	|	ДанныеУчета.Раздел3_СТР432,
	|	ДанныеУчета.Раздел3_СТР433,
	|	ДанныеУчета.Раздел3_СТР434,
	|	ДанныеУчета.Раздел3_СТР441 + ДанныеУчета.Раздел3_СТР442 + ДанныеУчета.Раздел3_СТР443 + ДанныеУчета.Раздел3_СТР444 КАК Раздел3_СТР440,
	|	ДанныеУчета.Раздел3_СТР441,
	|	ДанныеУчета.Раздел3_СТР442,
	|	ДанныеУчета.Раздел3_СТР443,
	|	ДанныеУчета.Раздел3_СТР444,
	|	ДанныеУчета.Раздел3_СТР411 + ДанныеУчета.Раздел3_СТР412 + ДанныеУчета.Раздел3_СТР413 + ДанныеУчета.Раздел3_СТР421 + ДанныеУчета.Раздел3_СТР422 + ДанныеУчета.Раздел3_СТР423 + ДанныеУчета.Раздел3_СТР431 + ДанныеУчета.Раздел3_СТР432 + ДанныеУчета.Раздел3_СТР433 + ДанныеУчета.Раздел3_СТР434 + ДанныеУчета.Раздел3_СТР441 + ДанныеУчета.Раздел3_СТР442 + ДанныеУчета.Раздел3_СТР443 + ДанныеУчета.Раздел3_СТР444 КАК Раздел3_СТР400
	|ИЗ
	|	(ВЫБРАТЬ
	|		Данные.КБК КАК КБК,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка011Исключения))
	|						И Данные.ОтношениеКДенежномуСодержанию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР011,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка012)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР012,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И (Данные.ОтношениеКДенежномуСодержанию В (&Строка013)
	|							ИЛИ Данные.ОтношениеКДенежномуСодержанию = ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР013,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка021)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР021,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка022)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР022,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка023)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР023,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка024)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР024,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка025Исключения))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР025,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка031)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР031,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка032)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР032,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка033Исключения))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР033,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуДовольствию В (&Строка041)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР041,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуДовольствию В (&Строка042Исключения))
	|						И Данные.ОтношениеКДенежномуДовольствию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР042,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуДовольствию В (&Строка043)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР043,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР050,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР060,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР411,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР412,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР413,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР421,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР422,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР423,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР431,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР432,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР433,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР434,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР441,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР442,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР443,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР444
	|	ИЗ
	|		ВТДанныеУчета КАК Данные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Данные.КБК) КАК ДанныеУчета";

	
	 Строка011Исключения = Новый СписокЗначений;
	Строка011Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Строка011Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка011Исключения", Строка011Исключения);
	
	 Строка012 = Новый СписокЗначений;
	Строка012.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка012", Строка012);
	
	 Строка013 = Новый СписокЗначений;
	Строка013.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строка013", Строка013);
	
	 Строка021 = Новый СписокЗначений;
	Строка021.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строка021.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Запрос.УстановитьПараметр("Строка021", Строка021);
	
	 Строка022 = Новый СписокЗначений;
	Строка022.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Запрос.УстановитьПараметр("Строка022", Строка022);
	
	 Строка023 = Новый СписокЗначений;
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Запрос.УстановитьПараметр("Строка023", Строка023);
	
	 Строка024 = Новый СписокЗначений;
	Строка024.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка024", Строка024);
	
	 Строка025Исключения = Новый СписокЗначений;
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строка025Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Запрос.УстановитьПараметр("Строка025Исключения", Строка025Исключения);
	
	Строка031 = Новый СписокЗначений;
	Строка031.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Запрос.УстановитьПараметр("Строка031", Строка031);
	
	 Строка032 = Новый СписокЗначений;
	Строка032.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка032.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Запрос.УстановитьПараметр("Строка032", Строка032);
	
	 Строка033Исключения = Новый СписокЗначений;
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Запрос.УстановитьПараметр("Строка033Исключения", Строка033Исключения);
	
	 Строка041 = Новый СписокЗначений;
	Строка041.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскомуЗванию);
	Строка041.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскойДолжности);
	Запрос.УстановитьПараметр("Строка041", Строка041);
	
	 Строка042Исключения = Новый СписокЗначений;
	Строка042Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскомуЗванию);
	Строка042Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскойДолжности);
	Запрос.УстановитьПараметр("Строка042Исключения", Строка042Исключения);
	
	 Строка043 = Новый СписокЗначений;
	Строка043.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.НадбавкаЗаОсобыеУсловияСлужбы);
	Запрос.УстановитьПараметр("Строка043", Строка043);
	
	Строки400 = Новый СписокЗначений;
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строки400", Строки400);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДанных.Расходы = РезультатЗапроса.Выбрать();
	
	СтруктураДанных.Справка = СтруктураДанных.Расходы;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеПоФорме14_259н_Расходы(Организация, ДатаНачала, ДатаОкончания) экспорт
	
	СтруктураДанных = Новый Структура("Расходы, Справка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация 		= Организация;
	ПараметрыПолученияСотрудников.НачалоПериода 	= ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= ДатаОкончания;
			
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
			Запрос.МенеджерВременныхТаблиц, Истина, 
			ПараметрыПолученияСотрудников, 
			"ВТСотрудникиОрганизации");
			
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
	КадровыеДанные = "ВидДоговора";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);			
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
		
	// начисления, которые показываются в отчетах в составе других начислений
	МассивВРДляРаспределения = Новый Массив;
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеРайонныйКоэффициент());
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеСевернаяНадбавка());
	Запрос.УстановитьПараметр("МассивВРДляРаспределения", МассивВРДляРаспределения);
	
	МассивВидыДоговоров = Новый Массив;
	МассивВидыДоговоров.Добавить(Перечисления.ВидыДоговоровССотрудниками.КонтрактГосслужащего);
	МассивВидыДоговоров.Добавить(Перечисления.ВидыДоговоровССотрудниками.КонтрактВоеннослужащего);
	Запрос.УстановитьПараметр("МассивВидыДоговоров", МассивВидыДоговоров);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("парамИзмерения", Измерения);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	Разрезы.Добавить("ВидРасчета");
	Разрезы.Добавить("ПериодРегистрации");
	Запрос.УстановитьПараметр("парамРазрезы", Разрезы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияБазаНачисления.Сотрудник КАК Сотрудник,
	|	НачисленияБазаНачисления.ПериодРегистрацииРазрез КАК Период,
	|	НачисленияБазаНачисления.РегистраторРазрез КАК Регистратор,
	|	НачисленияБазаНачисления.ВидРасчетаРазрез КАК ВидРасчета,
	|	НачисленияБазаНачисления.РезультатБаза КАК Результат,
	|	НачисленияБазаНачисления.ПериодРегистрации КАК ПериодВР,
	|	НачисленияБазаНачисления.Регистратор КАК РегистраторВР,
	|	НачисленияБазаНачисления.ВидРасчета КАК ВидРасчетаВР,
	|	НачисленияБазаНачисления.Результат КАК РезультатВР,
	|	НачисленияБазаНачисления.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТВРДляРаспределения
	|ИЗ
	|	РегистрРасчета.Начисления.БазаНачисления(
	|			&ПарамИзмерения,
	|			&ПарамИзмерения,
	|			&ПарамРазрезы,
	|			ВидРасчета В (&МассивВРДляРаспределения)
	|				И Организация = &Организация
	|				И (ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И Результат <> 0) КАК НачисленияБазаНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО НачисленияБазаНачисления.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	КадровыеДанныеСотрудников.ВидДоговора В (&МассивВидыДоговоров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.РегистраторВР
	|ПОМЕСТИТЬ ВТСторнировавшиеДокументы
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|ГДЕ
	|	ПромежуточныеДанные.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.Сотрудник,
	|	ПромежуточныеДанные.Период,
	|	ПромежуточныеДанные.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ПромежуточныеДанные.РегистраторВР В
	|				(ВЫБРАТЬ
	|					СторнировавшиеДокументы.РегистраторВР
	|				ИЗ
	|					ВТСторнировавшиеДокументы КАК СторнировавшиеДокументы)
	|			ТОГДА ПромежуточныеДанные.РегистраторВР
	|		ИНАЧЕ ПромежуточныеДанные.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ПромежуточныеДанные.Результат,
	|	ПромежуточныеДанные.ПериодВР,
	|	ПромежуточныеДанные.РегистраторВР,
	|	ПромежуточныеДанные.ВидРасчетаВР,
	|	ПромежуточныеДанные.РезультатВР
	|ПОМЕСТИТЬ ВТБаза
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияВР.Регистратор КАК РегистраторВР,
	|	НачисленияВР.НомерСтроки КАК НомерСтрокиВР,
	|	НачисленияВР.Сумма КАК РезультатВР,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки,
	|	Начисления.Сумма КАК Результат
	|ИЗ
	|	ВТБаза КАК База
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияВР
	|		ПО (НачисленияВР.Регистратор = База.РегистраторВР)
	|			И (НачисленияВР.Период = База.ПериодВР)
	|			И (НачисленияВР.Сотрудник = База.Сотрудник)
	|			И (НачисленияВР.НачислениеУдержание = База.ВидРасчетаВР)
	|			И (НачисленияВР.Организация = &Организация)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ПО (Начисления.Регистратор = База.Регистратор)
	|			И (Начисления.Период = База.Период)
	|			И (Начисления.Сотрудник = База.Сотрудник)
	|			И (Начисления.НачислениеУдержание = База.ВидРасчета)
	|			И (Начисления.Организация = &Организация)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияВР.Регистратор,
	|	НачисленияВР.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРегистраторов = РегистрыРасчета.Начисления.СоздатьНаборЗаписей().ВыгрузитьКолонки("Регистратор");
	МассивТиповДокументов = Новый Массив;
	Для каждого ТипДокумента Из ТаблицаРегистраторов.Колонки.Регистратор.ТипЗначения.Типы() Цикл
		МассивТиповДокументов.Добавить(ТипДокумента);
	КонецЦикла;
	
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("Регистратор", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаРаспределения.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределения.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	
	ВремТаблица = ТаблицаРаспределения.СкопироватьКолонки();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РегистраторВР") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтрокиВР") Цикл
			
			СуммаКРаспределению = Выборка.РезультатВР;
			
			ВремТаблица.Очистить();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ВремТаблица.Добавить(),Выборка);
			КонецЦикла;
			
			МассивКоэффициентов = ВремТаблица.ВыгрузитьКолонку("Результат");
			МассивСуммКНачислению = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СуммаКРаспределению,МассивКоэффициентов);
			
			Если МассивСуммКНачислению <> Неопределено Тогда
				
				Для каждого СтрокаТЗ Из ВремТаблица Цикл
					
					НоваяСтрока = ТаблицаРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
					НоваяСтрока.Результат = МассивСуммКНачислению[ВремТаблица.Индекс(СтрокаТЗ)];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	ТаблицаРаспределения.Свернуть("Регистратор,НомерСтроки","Результат");
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	
	СохраняемоеДенежноеСодержание = Новый Массив;
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СохраняемоеДенежноеСодержание);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодОтпуска);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособиеМесячноеДенежноеСодержание);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДоплатаДоДенежногоСодержанияЗаДниБолезни);
	СохраняемоеДенежноеСодержание.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодКомандировки);
	
	Запрос.УстановитьПараметр("СохраняемоеДенежноеСодержание", СохраняемоеДенежноеСодержание);
	МассивКОСГУ = Новый Массив;
	МассивКОСГУ.Добавить(ОтражениеЗарплатыВБухучетеРасширенный.СтатьяРасходов211());
	Запрос.УстановитьПараметр("КОСГУ", МассивКОСГУ);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Период КАК Период,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ДокументОснование КАК ДокументОснование,
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.НомерСтроки,
	|	Начисления.СтатьяФинансирования,
	|	Начисления.НачислениеУдержание КАК ВидРасчета,
	|	Начисления.Сумма КАК Результат
	|ПОМЕСТИТЬ ВТСохраняемоеДенежноеСодержание
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|ГДЕ
	|	Начисления.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В(&СохраняемоеДенежноеСодержание)
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И Начисления.СтатьяРасходов В(&КОСГУ)
	|	И Начисления.Организация = &Организация
	|	И Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.Сумма <> 0 
	|
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Регистратор,
	|	ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСохраняемоеДенежноеСодержание.Период,
	|	ВТСохраняемоеДенежноеСодержание.Сотрудник,
	|	ВТСохраняемоеДенежноеСодержание.ВидРасчета,
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)) КАК ОтношениеКДенежномуСодержанию,
	|	ВТСохраняемоеДенежноеСодержание.СтатьяФинансирования,
	|	ВТСохраняемоеДенежноеСодержание.Результат,
	|	ВТСохраняемоеДенежноеСодержание.Регистратор КАК Регистратор,
	|	ВТСохраняемоеДенежноеСодержание.НомерСтроки КАК НомерСтроки,
	|	СУММА(СоставСохраняемогоДенежногоСодержания.Сумма) КАК РезультатБаза
	|ИЗ
	|	ВТСохраняемоеДенежноеСодержание КАК ВТСохраняемоеДенежноеСодержание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СоставСохраняемогоДенежногоСодержания КАК СоставСохраняемогоДенежногоСодержания
	|		ПО  
	|          (ВЫБОР 
	|          	КОГДА ВТСохраняемоеДенежноеСодержание.ДокументОснование = НЕОПРЕДЕЛЕНО 
	|           	ТОГДА ВТСохраняемоеДенежноеСодержание.Регистратор
	|           ИНАЧЕ ВТСохраняемоеДенежноеСодержание.ДокументОснование
	|          КОНЕЦ = СоставСохраняемогоДенежногоСодержания.Регистратор)
	|			И (СоставСохраняемогоДенежногоСодержания.Сумма <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваНачисленийГосударственныхСлужащих КАК СвойстваНачисленийГосударственныхСлужащих
	|		ПО СвойстваНачисленийГосударственныхСлужащих.Начисление = СоставСохраняемогоДенежногоСодержания.Начисление
	|
	|ГДЕ
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)) <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСохраняемоеДенежноеСодержание.Период,
	|	ВТСохраняемоеДенежноеСодержание.Сотрудник,
	|	ВТСохраняемоеДенежноеСодержание.ВидРасчета,
	|	ВТСохраняемоеДенежноеСодержание.СтатьяФинансирования,
	|	ЕСТЬNULL(СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию,ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты)),
	|	ВТСохраняемоеДенежноеСодержание.Регистратор,
	|	ВТСохраняемоеДенежноеСодержание.Результат,
	|	ВТСохраняемоеДенежноеСодержание.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивТиповПВР = Новый Массив;
	МассивТиповПВР.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
	
	ТаблицаРаспределенияДС = Новый ТаблицаЗначений;
	ТаблицаРаспределенияДС.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаРаспределенияДС.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов(МассивТиповПВР));
	ТаблицаРаспределенияДС.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаРаспределенияДС.Колонки.Добавить("ОтношениеКДенежномуСодержанию", Новый ОписаниеТипов("ПеречислениеСсылка.ОтношениеНачисленийКДенежномуСодержанию"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Регистратор", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаРаспределенияДС.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределенияДС.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	
	ВремТаблица = ТаблицаРаспределенияДС.СкопироватьКолонки();
	ВремТаблица.Колонки.Добавить("РезультатБаза", Новый ОписаниеТипов("Число"));
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			
			СуммаКРаспределению = Выборка.Результат;
			
			ВремТаблица.Очистить();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ВремТаблица.Добавить(),Выборка);
			КонецЦикла;
			
			МассивКоэффициентов = ВремТаблица.ВыгрузитьКолонку("РезультатБаза");
			МассивСуммКНачислению = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СуммаКРаспределению,МассивКоэффициентов);
			
			Если МассивСуммКНачислению <> Неопределено Тогда
				
				Для каждого СтрокаТЗ Из ВремТаблица Цикл
					
					НоваяСтрока = ТаблицаРаспределенияДС.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
					НоваяСтрока.Результат = МассивСуммКНачислению[ВремТаблица.Индекс(СтрокаТЗ)];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРаспределенияДС", ТаблицаРаспределенияДС);	
	
	ПараметрыПолученияРабочихМест = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияРабочихМест,ПараметрыПолученияСотрудников);
	// Получаем рабочие места сотрудников
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияРабочихМест);
			
	ВидыДолжностейОтчета = Новый Массив;
	ВидыДолжностейОтчета.Добавить("ГосударственнаяДолжность");
	ВидыДолжностейОтчета.Добавить("ДолжностьГосударственнойГражданскойСлужбы");
	ВидыДолжностейОтчета.Добавить("ОтдельнаяДолжностьГосударственнойГражданскойСлужбы");
	ВидыДолжностейОтчета.Добавить("ДолжностьИногоВидаФедеральнойГосударственнойСлужбы");
	Запрос.УстановитьПараметр("ВидыДолжностейОтчета", ВидыДолжностейОтчета);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Регистратор КАК Регистратор,
	|	ТаблицаРаспределения.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределения.Результат
	|ПОМЕСТИТЬ ВТТаблицаРаспределения
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспределенияДС.Период КАК Период,
	|	ТаблицаРаспределенияДС.Сотрудник КАК Сотрудник,
	|	ТаблицаРаспределенияДС.ВидРасчета КАК ВидРасчета,
	|	ТаблицаРаспределенияДС.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ТаблицаРаспределенияДС.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,
	|	ТаблицаРаспределенияДС.Регистратор КАК Регистратор,
	|	ТаблицаРаспределенияДС.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределенияДС.Результат
	|ПОМЕСТИТЬ ВТТаблицаРаспределенияДС
	|ИЗ
	|	&ТаблицаРаспределенияДС КАК ТаблицаРаспределенияДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Должность,
	|	ЕСТЬNULL(СтрокиОтчетностиРасходовИЧисленности.СтрокаОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов.КодКатегорииПерсонала,"""") КАК КодКатегорииПерсонала,
	|	СвойстваДолжностейГосударственнойСлужбы.КатегорияДолжностиГосударственнойСлужбы КАК КатегорияДолжностиГосударственнойСлужбы,
	|	СвойстваДолжностейГосударственнойСлужбы.ГруппаДолжностиГосударственнойСлужбы
	|ПОМЕСТИТЬ ВТДвиженияРаботников
	|ИЗ
	|	ВТРабочиеМестаСотрудников КАК РаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов КАК СтрокиОтчетностиРасходовИЧисленности
	|		ПО (СтрокиОтчетностиРасходовИЧисленности.Должность = РаботникиОрганизации.Должность)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейГосударственнойСлужбы КАК СвойстваДолжностейГосударственнойСлужбы
	|		ПО (СвойстваДолжностейГосударственнойСлужбы.Должность = РаботникиОрганизации.Должность)
	|ГДЕ
	|	РаботникиОрганизации.Организация = &Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(Начисления.Период, МЕСЯЦ) КАК Период,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.НачислениеУдержание КАК ВидРасчета,
	|	СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,
	|	СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуДовольствию КАК ОтношениеКДенежномуДовольствию,
	|	Начисления.СтатьяФинансирования,
	|	Начисления.Сумма КАК Результат,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваНачисленийГосударственныхСлужащих КАК СвойстваНачисленийГосударственныхСлужащих
	|		ПО СвойстваНачисленийГосударственныхСлужащих.Начисление = Начисления.НачислениеУдержание	
	|ГДЕ
	|	Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И Начисления.Организация = &Организация
	|	И Начисления.СтатьяРасходов В(&КОСГУ)
	|	И Начисления.Сумма <> 0
	|	И (НЕ Начисления.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени В (&СохраняемоеДенежноеСодержание))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаРаспределенияДС.Период,
	|	ВТТаблицаРаспределенияДС.Сотрудник,
	|	ВТТаблицаРаспределенияДС.ВидРасчета,
	|	ВТТаблицаРаспределенияДС.ОтношениеКДенежномуСодержанию,
	|   ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуДовольствию.ПустаяСсылка),
	|	ВТТаблицаРаспределенияДС.СтатьяФинансирования,
	|	ВТТаблицаРаспределенияДС.Результат,
	|	ВТТаблицаРаспределенияДС.Регистратор,
	|	ВТТаблицаРаспределенияДС.НомерСтроки
	|ИЗ
	|	ВТТаблицаРаспределенияДС КАК ВТТаблицаРаспределенияДС
	|ГДЕ
	|	ВТТаблицаРаспределенияДС.Результат <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ТаблицаНачислений.Период КАК Период,
	|	МАКСИМУМ(ВТДвиженияРаботников.Период) КАК ПериодДвижения
	|ПОМЕСТИТЬ ВТДвиженияНачисления
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|			И (ВТДвиженияРаботников.Период <= ТаблицаНачислений.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаНачислений.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)) КАК КБК,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,	
	|	ТаблицаНачислений.ОтношениеКДенежномуДовольствию КАК ОтношениеКДенежномуДовольствию,	
	|	ЕСТЬNULL(ВТДвиженияРаботников.КодКатегорииПерсонала, """") КАК КодКатегорииПерсонала,
	|	ЕСТЬNULL(ВТДвиженияРаботников.КатегорияДолжностиГосударственнойСлужбы, ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ПустаяСсылка)) КАК КатегорияДолжности,
	|	ЕСТЬNULL(ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы, ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.ПустаяСсылка)) КАК ГруппаДолжности,
	|	СУММА(ТаблицаНачислений.Результат + ЕСТЬNULL(ВТТаблицаРаспределения.Результат, 0)) КАК Результат
	|ПОМЕСТИТЬ ВТДанныеУчета
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияНачисления КАК ВТДвиженияНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|			ПО ВТДвиженияНачисления.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|				И ВТДвиженияНачисления.ПериодДвижения = ВТДвиженияРаботников.Период
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияНачисления.Сотрудник
	|			И ТаблицаНачислений.Период = ВТДвиженияНачисления.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаРаспределения КАК ВТТаблицаРаспределения
	|		ПО ТаблицаНачислений.Регистратор = ВТТаблицаРаспределения.Регистратор
	|			И ТаблицаНачислений.НомерСтроки = ВТТаблицаРаспределения.НомерСтроки
	|			И (ВТДвиженияРаботников.КодКатегорииПерсонала В (&ВидыДолжностейОтчета))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТДвиженияРаботников.КодКатегорииПерсонала В (&ВидыДолжностейОтчета)
	|					И ТаблицаНачислений.ВидРасчета В (&МассивВРДляРаспределения)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию,
	|	ТаблицаНачислений.ОтношениеКДенежномуДовольствию,	
	|	ВТДвиженияРаботников.КатегорияДолжностиГосударственнойСлужбы,
	|	ВТДвиженияРаботников.КодКатегорииПерсонала,
	|	ТаблицаНачислений.СтатьяФинансирования,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчета.КБК,
	|	ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012 + ДанныеУчета.Раздел1_СТР013 КАК Раздел1_СТР010,
	|	ДанныеУчета.Раздел1_СТР011,
	|	ДанныеУчета.Раздел1_СТР012,
	|	ДанныеУчета.Раздел1_СТР013,
	|	ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР023 + ДанныеУчета.Раздел1_СТР026 КАК Раздел1_СТР020,
	|	ДанныеУчета.Раздел1_СТР021,
	|	ДанныеУчета.Раздел1_СТР022,
	|	ДанныеУчета.Раздел1_СТР023,
	|	ДанныеУчета.Раздел1_СТР024,
	|	ДанныеУчета.Раздел1_СТР026,
	|	ДанныеУчета.Раздел1_СТР031 + ДанныеУчета.Раздел1_СТР032 + ДанныеУчета.Раздел1_СТР033 КАК Раздел1_СТР030,
	|	ДанныеУчета.Раздел1_СТР031,
	|	ДанныеУчета.Раздел1_СТР032,
	|	ДанныеУчета.Раздел1_СТР033,
	|	ДанныеУчета.Раздел1_СТР041 + ДанныеУчета.Раздел1_СТР042 КАК Раздел1_СТР040,
	|	ДанныеУчета.Раздел1_СТР041,
	|	ДанныеУчета.Раздел1_СТР042,
	|	ДанныеУчета.Раздел1_СТР043,
	|	ДанныеУчета.Раздел1_СТР050,
	|	ДанныеУчета.Раздел1_СТР060,
	|	ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012 + ДанныеУчета.Раздел1_СТР013 + ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР023 + ДанныеУчета.Раздел1_СТР026 + ДанныеУчета.Раздел1_СТР031 + ДанныеУчета.Раздел1_СТР032 + ДанныеУчета.Раздел1_СТР033 + ДанныеУчета.Раздел1_СТР041 + ДанныеУчета.Раздел1_СТР042 + ДанныеУчета.Раздел1_СТР050 + ДанныеУчета.Раздел1_СТР060 КАК Раздел1_СТР070_Факт,
	|	ДанныеУчета.Раздел3_СТР411 + ДанныеУчета.Раздел3_СТР412 + ДанныеУчета.Раздел3_СТР413 КАК Раздел3_СТР410,
	|	ДанныеУчета.Раздел3_СТР411,
	|	ДанныеУчета.Раздел3_СТР412,
	|	ДанныеУчета.Раздел3_СТР413,
	|	ДанныеУчета.Раздел3_СТР421 + ДанныеУчета.Раздел3_СТР422 + ДанныеУчета.Раздел3_СТР423 КАК Раздел3_СТР420,
	|	ДанныеУчета.Раздел3_СТР421,
	|	ДанныеУчета.Раздел3_СТР422,
	|	ДанныеУчета.Раздел3_СТР423,
	|	ДанныеУчета.Раздел3_СТР431 + ДанныеУчета.Раздел3_СТР432 + ДанныеУчета.Раздел3_СТР433 + ДанныеУчета.Раздел3_СТР434 КАК Раздел3_СТР430,
	|	ДанныеУчета.Раздел3_СТР431,
	|	ДанныеУчета.Раздел3_СТР432,
	|	ДанныеУчета.Раздел3_СТР433,
	|	ДанныеУчета.Раздел3_СТР434,
	|	ДанныеУчета.Раздел3_СТР441 + ДанныеУчета.Раздел3_СТР442 + ДанныеУчета.Раздел3_СТР443 + ДанныеУчета.Раздел3_СТР444 КАК Раздел3_СТР440,
	|	ДанныеУчета.Раздел3_СТР441,
	|	ДанныеУчета.Раздел3_СТР442,
	|	ДанныеУчета.Раздел3_СТР443,
	|	ДанныеУчета.Раздел3_СТР444,
	|	ДанныеУчета.Раздел3_СТР411 + ДанныеУчета.Раздел3_СТР412 + ДанныеУчета.Раздел3_СТР413 + ДанныеУчета.Раздел3_СТР421 + ДанныеУчета.Раздел3_СТР422 + ДанныеУчета.Раздел3_СТР423 + ДанныеУчета.Раздел3_СТР431 + ДанныеУчета.Раздел3_СТР432 + ДанныеУчета.Раздел3_СТР433 + ДанныеУчета.Раздел3_СТР434 + ДанныеУчета.Раздел3_СТР441 + ДанныеУчета.Раздел3_СТР442 + ДанныеУчета.Раздел3_СТР443 + ДанныеУчета.Раздел3_СТР444 КАК Раздел3_СТР400
	|ИЗ
	|	(ВЫБРАТЬ
	|		Данные.КБК КАК КБК,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка011Исключения))
	|						И Данные.ОтношениеКДенежномуСодержанию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР011,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка012)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР012,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|						И (Данные.ОтношениеКДенежномуСодержанию В (&Строка013)
	|							ИЛИ Данные.ОтношениеКДенежномуСодержанию = ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР013,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка021)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР021,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка022)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР022,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка023)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР023,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка024)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР024,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка026Исключения))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР026,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка031)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР031,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка032)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР032,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка033Исключения))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР033,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуДовольствию В (&Строка041)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР041,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуДовольствию В (&Строка042Исключения))
	|						И Данные.ОтношениеКДенежномуДовольствию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР042,
	|		СУММА(ВЫБОР
	|				КОГДА (Данные.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуДовольствию В (&Строка043)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР043,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР050,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР060,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР411,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР412,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР413,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР421,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР422,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР423,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР431,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР432,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР433,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР434,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР441,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР442,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР443,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьГосударственнойГражданскойСлужбы"", ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы"")
	|						И Данные.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строки400)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР444
	|	ИЗ
	|		ВТДанныеУчета КАК Данные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Данные.КБК) КАК ДанныеУчета";

	
	 Строка011Исключения = Новый СписокЗначений;
	Строка011Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Строка011Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка011Исключения", Строка011Исключения);
	
	 Строка012 = Новый СписокЗначений;
	Строка012.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка012", Строка012);
	
	 Строка013 = Новый СписокЗначений;
	Строка013.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строка013", Строка013);
	
	 Строка021 = Новый СписокЗначений;
	Строка021.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строка021.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Запрос.УстановитьПараметр("Строка021", Строка021);
	
	 Строка022 = Новый СписокЗначений;
	Строка022.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Запрос.УстановитьПараметр("Строка022", Строка022);
	
	 Строка023 = Новый СписокЗначений;
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Запрос.УстановитьПараметр("Строка023", Строка023);
	
	 Строка024 = Новый СписокЗначений;
	Строка024.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка024", Строка024);
	
	 Строка026Исключения = Новый СписокЗначений;
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строка026Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Запрос.УстановитьПараметр("Строка026Исключения", Строка026Исключения);
	
	Строка031 = Новый СписокЗначений;
	Строка031.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Запрос.УстановитьПараметр("Строка031", Строка031);
	
	 Строка032 = Новый СписокЗначений;
	Строка032.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка032.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Запрос.УстановитьПараметр("Строка032", Строка032);
	
	 Строка033Исключения = Новый СписокЗначений;
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строка033Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Запрос.УстановитьПараметр("Строка033Исключения", Строка033Исключения);
	
	 Строка041 = Новый СписокЗначений;
	Строка041.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскомуЗванию);
	Строка041.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскойДолжности);
	Запрос.УстановитьПараметр("Строка041", Строка041);
	
	 Строка042Исключения = Новый СписокЗначений;
	Строка042Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскомуЗванию);
	Строка042Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ОкладПоВоинскойДолжности);
	Запрос.УстановитьПараметр("Строка042Исключения", Строка042Исключения);
	
	 Строка043 = Новый СписокЗначений;
	Строка043.Добавить(Перечисления.ОтношениеНачисленийКДенежномуДовольствию.НадбавкаЗаОсобыеУсловияСлужбы);
	Запрос.УстановитьПараметр("Строка043", Строка043);
	
	Строки400 = Новый СписокЗначений;
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ОкладЗаКлассныйЧин);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаВыслугуЛет);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаОсобыеУсловияСлужбы);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.НадбавкаЗаСекретность);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиновременнаяВыплатаКОтпуску);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.МатериальнаяПомощь);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕдиноеДенежноеВознаграждение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПремияЗаОсобоВажныеИСложныеЗадания);
	Строки400.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строки400", Строки400);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДанных.Расходы = РезультатЗапроса.Выбрать();
	
	СтруктураДанных.Справка = СтруктураДанных.Расходы;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеПоФорме14Численность(Организация, ДатаНачала, ДатаОкончания) экспорт 
	
	ТаблицаДанныхОтчета = Новый ТаблицаЗначений;
	ТаблицаДанныхОтчета.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаДанныхОтчета.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КодКатегорииПерсонала", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТаблицаДанныхОтчета.Колонки.Добавить("КатегорияДолжности", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииДолжностейГосударственнойСлужбы"));
	ТаблицаДанныхОтчета.Колонки.Добавить("ГруппаДолжности", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыДолжностейГосударственнойСлужбы"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КоличествоСтавок", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КоличествоЗанятыхСтавок", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СписочнаяЧисленность", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СписочнаяЧисленностьНаКонецПериода", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СреднесписочнаяЧисленность", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СреднесписочнаяЧисленностьЗаПериод", Новый ОписаниеТипов("Число"));
		
	СтруктураЧисленности = СтатистикаПерсоналаРасширенный.СведенияОДолжностяхИЧисленностиРегламентированнойОтчетности(Организация, ДатаНачала, ДатаОкончания);
	
	
	СтрокаОрганизации = СтруктураЧисленности.ДанныеШтатногоРасписания.Строки.Найти(Организация, "Организация");
	Если СтрокаОрганизации <> Неопределено Тогда
		Для Каждого СтрокаЧисленности Из СтрокаОрганизации.Строки Цикл
	   		НоваяСтрокаОтчета = ТаблицаДанныхОтчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОтчета,СтрокаЧисленности);
			НоваяСтрокаОтчета.КодКатегорииПерсонала = СтрокаЧисленности.Должность_СтрокаОтчетностиФормы14_КодКатегорииПерсонала;
			НоваяСтрокаОтчета.КатегорияДолжности 	= СтрокаЧисленности.Должность_КатегорияДолжности_;
			НоваяСтрокаОтчета.ГруппаДолжности 		= СтрокаЧисленности.Должность_ГруппаДолжности_;
		КонецЦикла;	
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Подразделение,Должность");
	СтрокаОрганизации = СтруктураЧисленности.ДанныеСреднесписочнойЧисленности.Строки.Найти(Организация, "Организация");
	Если СтрокаОрганизации <> Неопределено Тогда
		Для Каждого СтрокаЧисленности Из СтрокаОрганизации.Строки Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаЧисленности);
			ПозицииШтатногоРасписания = ТаблицаДанныхОтчета.НайтиСтроки(СтруктураПоиска);
			Если ПозицииШтатногоРасписания.Количество() > 0 Тогда
				СтрокаШР = ПозицииШтатногоРасписания[0];
				СтрокаШР.СписочнаяЧисленность 				= СтрокаШР.СписочнаяЧисленность + СтрокаЧисленности.ЧисленностьСписочногоСостава;
				СтрокаШР.СписочнаяЧисленностьНаКонецПериода = СтрокаШР.СписочнаяЧисленностьНаКонецПериода + СтрокаЧисленности.ЧисленностьНаКонецПериодаСписочногоСостава;
				СтрокаШР.СреднесписочнаяЧисленность 		= СтрокаШР.СреднесписочнаяЧисленность + СтрокаЧисленности.СредняяЧисленностьСписочногоСостава;
				СтрокаШР.СреднесписочнаяЧисленностьЗаПериод = СтрокаШР.СреднесписочнаяЧисленностьЗаПериод + СтрокаЧисленности.СредняяЧисленностьЗаПериодСписочногоСостава;
			Иначе
				СтрокаШР = ТаблицаДанныхОтчета.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаШР,СтрокаЧисленности);
				СтрокаШР.КодКатегорииПерсонала 	= СтрокаЧисленности.Должность_СтрокаОтчетностиФормы14_КодКатегорииПерсонала;
				СтрокаШР.КатегорияДолжности 	= СтрокаЧисленности.Должность_КатегорияДолжности_;
				СтрокаШР.ГруппаДолжности 		= СтрокаЧисленности.Должность_ГруппаДолжности_;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	ТаблицаДанныхОтчета.Свернуть("СтатьяФинансирования,КодКатегорииПерсонала,КатегорияДолжности,ГруппаДолжности","КоличествоСтавок,СписочнаяЧисленностьНаКонецПериода,СреднесписочнаяЧисленность,СреднесписочнаяЧисленностьЗаПериод");
	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаДанныхОтчета", ТаблицаДанныхОтчета);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанныхОтчета.СтатьяФинансирования,
	|	ТаблицаДанныхОтчета.КодКатегорииПерсонала,
	|	ТаблицаДанныхОтчета.КатегорияДолжности,
	|	ТаблицаДанныхОтчета.ГруппаДолжности,
	|	ТаблицаДанныхОтчета.КоличествоСтавок,
	|	ТаблицаДанныхОтчета.СписочнаяЧисленностьНаКонецПериода,
	|	ТаблицаДанныхОтчета.СреднесписочнаяЧисленностьЗаПериод КАК Среднесписочная
	|ПОМЕСТИТЬ ВТТаблицаДанныхОтчета
	|ИЗ &ТаблицаДанныхОтчета КАК ТаблицаДанныхОтчета
	|;	
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР310Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР241Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР242Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР243Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР251Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР252Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР253Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР261Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР262Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР263Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР264Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР271Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР272Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР273Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР274Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР300Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР310Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР241Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР242Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР243Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР251Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР252Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР253Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР261Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР262Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР263Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР264Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР271Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР272Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР273Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР274Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР300Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР310Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжность""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР241Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР242Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Руководители)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР243Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР251Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР252Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Помощники)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР253Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР261Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР262Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР263Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.Специалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР264Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР271Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР272Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР273Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА (ДолжностиОрганизаций.КодКатегорииПерсонала = ""ОтдельнаяДолжностьГосударственнойГражданскойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьГосударственнойГражданскойСлужбы"")
	|					И ДолжностиОрганизаций.КатегорияДолжности = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейГосударственнойСлужбы.ОбеспечивающиеСпециалисты)
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР274Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьИногоВидаФедеральнойГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюГосударственнойСлужбы""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ГосударственнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ЕСТЬNULL(ДолжностиОрганизаций.Среднесписочная, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР300Гр3,
	|	ЕСТЬNULL(ДолжностиОрганизаций.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)) КАК КБК
	|ИЗ
	|	ВТТаблицаДанныхОтчета КАК ДолжностиОрганизаций
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ДолжностиОрганизаций.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка))";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

Процедура СформироватьОтчетФорма14(ТаблицаОтчета, Организация, ДатаНачала, ДатаОкончания)
	
	Точность = 4;
	
	ВариантЗаполнения = "";
	Если ДатаОкончания >= ДатаПереходаНа259н() Тогда
		ВариантЗаполнения = "259н";
		Макет = ПолучитьМакет("Форма14_по_259н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа86н() Тогда
		Макет = ПолучитьМакет("Форма14_по_86н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа143н() Тогда
		Макет = ПолучитьМакет("Форма14_по_143н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа179н() Тогда
		Макет = ПолучитьМакет("Форма14_по_179н")
	Иначе	
		Макет = ПолучитьМакет("Форма14")
	КонецЕсли;	
		
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Если Точность = 1 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Рубль";
	ИначеЕсли Точность = 4 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Тысяча рублей";
	ИначеЕсли Точность = 7 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Миллион рублей";
	КонецЕсли;
	Шапка.Параметры.Организация = Организация.НаименованиеПолное;
	
	ТаблицаОтчета.Вывести(Шапка);
	
	Если ВариантЗаполнения = "259н" Тогда
		СтруктураДанных = ПолучитьДанныеПоФорме14_259н_Расходы(Организация, ДатаНачала, ДатаОкончания);		
	Иначе
		СтруктураДанных = ПолучитьДанныеПоФорме14_Расходы(Организация, ДатаНачала, ДатаОкончания);
	КонецЕсли;
	
	СтруктураДанных.Расходы.Сбросить();
	ВывестиРаздел(ТаблицаОтчета, СтруктураДанных.Расходы, 1, Точность-1, Макет);	
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВыборкаЧисленность = ПолучитьДанныеПоФорме14Численность(Организация, ДатаНачала, ДатаОкончания);
	ВывестиРаздел(ТаблицаОтчета, ВыборкаЧисленность, 2, 0, Макет);
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтруктураДанных.Расходы.Сбросить();
	ВывестиРаздел(ТаблицаОтчета, СтруктураДанных.Расходы, 3, Точность-1, Макет);	
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();	
	
	Если ВариантЗаполнения = "259н" Тогда
		СтруктураДанных.Расходы.Сбросить();
		ВывестиРаздел(ТаблицаОтчета, СтруктураДанных.Расходы, 4, 0, Макет);	
	КонецЕсли;
	
	ТаблицаОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТаблицаОтчета.Автомасштаб        = Истина;
	ТаблицаОтчета.ПолеСлева          = 0;
	ТаблицаОтчета.ПолеСправа         = 0;
	ТаблицаОтчета.Защита             = Ложь;
	ТаблицаОтчета.ТолькоПросмотр     = Истина;	
	
КонецПроцедуры 


#КонецОбласти

#КонецЕсли