////////////////////////////////////////////////////////////////////////////////
// Подсистема "Перенос данных из E-Staff Рекрутер".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить свойства вакансии перед ее записью.
//
// Параметры:
//	Объект - СправочникОбъект.Вакансии - записываемая вакансия.
//	ДанныеВакансии - ФиксированнаяСтруктура - свойства загружаемой вакансии, полученные из файла. Для определения необходимых
//  					свойств см. процедуру ПереносДанныхEStaffКлиентСерверПереопределяемый.ПриОпределенииИменСвойствВакансии.
//	Отказ - Булево - признак необходимости отказа от записи.
//
Процедура ПередЗаписьюВакансии(Объект, ДанныеВакансии, Отказ) Экспорт
	
КонецПроцедуры

// Позволяет записать данные вакансии, требующие на нее ссылку.
//
// Параметры:
//	Вакансия - СправочникСсылка.Вакансии - ссылка на вакансию.
//	ДанныеВакансии - ФиксированнаяСтруктура - свойства загруженной вакансии, полученные из файла. Для определения необходимых
//  					свойств см. процедуру ПереносДанныхEStaffКлиентСерверПереопределяемый.ПриОпределенииИменСвойствВакансии.
//
Процедура ПослеЗаписиВакансии(Вакансия, ДанныеВакансии) Экспорт
	
КонецПроцедуры

// Позволяет изменить свойства кандидата перед его записью.
//
// Параметры:
//	Объект - СправочникОбъект.Кандидаты - записываемый кандидат.
//	ДанныеКандидата - ФиксированнаяСтруктура - свойства загружаемого кандидата, полученные из файла. Для определения необходимых свойств
//  					см. процедуру ПереносДанныхEStaffКлиентСерверПереопределяемый.ПриОпределенииИменСвойствКандидата.
//	Отказ - Булево - признак необходимости отказа от записи.
//
Процедура ПередЗаписьюКандидата(Объект, ДанныеКандидата, Отказ) Экспорт
	
КонецПроцедуры

// Позволяет записать данные кандидата, требующие на него ссылку.
//
// Параметры:
//	Кандидат - СправочникСсылка.Кандидаты - ссылка на кандидата.
//	ДанныеКандидата - ФиксированнаяСтруктура - свойства загруженного кандидата, полученные из файла. 
// 						Для определения необходимых свойств см. процедуру 
//  					ПереносДанныхEStaffКлиентСерверПереопределяемый.ПриОпределенииИменСвойствКандидата.
//
Процедура ПослеЗаписиКандидата(Кандидат, ДанныеКандидата) Экспорт
	
КонецПроцедуры

#КонецОбласти
