
#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеВоинскогоСпециальногоЗвания(ВоинскоеСпециальноеЗвание, ДатаПрисвоения) Экспорт
	
	ТекстЗаголовка = НСтр("ru = 'Не присвоено'");
	
	Если ЗначениеЗаполнено(ВоинскоеСпециальноеЗвание) И ЗначениеЗаполнено(ДатаПрисвоения) Тогда 
		ТекстЗаголовка = СокрЛП(ВоинскоеСпециальноеЗвание) + Символы.ПС +  НСтр("ru = 'Дата присвоения:'") + " " + Формат(ДатаПрисвоения, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

#КонецОбласти
