////////////////////////////////////////////////////////////////////////////////
// Подсистема "Тарификационная отчетность в медицине".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ПоказателиРасчетаЗарплаты

Процедура ПоказательРасчетаЗарплатыПередЗаписью(Форма, Отказ) Экспорт
	
	Если Не Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ЯвляетсяПоказателемТарификации И Не ЗначениеЗаполнено(Форма.ВидПоказателяТарификации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не задан вид показателя тарификации.'"), ,"ВидПоказателяТарификации", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
