#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		
		ТекстСообщения = НСтр("ru = 'Месяц начала периода не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "МесяцНачалаСтрокой", , Отказ);
		
	ИначеЕсли Не ЗначениеЗаполнено(ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		ТекстСообщения = НСтр("ru = 'Месяц окончания периода не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "МесяцОкончанияСтрокой", , Отказ);

	ИначеЕсли ДатаОкончания < ДатаНачала Тогда
		
		ТекстСообщения = НСтр("ru = 'Период заполнен некорректно.
		|
		|Месяц начала периода больше, чем месяц его окончания.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "МесяцНачалаСтрокой", , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
