
#Область СлужебныеПроцедурыИФункции

Процедура РедактироватьКлассныйЧинРанг(Форма, Сотрудник, ДатаПрисвоения = '00010101', КлассныйЧинРанг = Неопределено) Экспорт

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", Сотрудник);
	ПараметрыОткрытия.Вставить("ДатаПрисвоения", ДатаПрисвоения);
	ПараметрыОткрытия.Вставить("КлассныйЧинРанг", КлассныйЧинРанг);
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеКлассногоЧинаРангаФизическогоЛица", ПараметрыОткрытия, Форма);	

КонецПроцедуры

#КонецОбласти
