#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СвойстваДолжностейПедагогическихРаботников";
	ПараметрыОбновления.ИдентификаторИсточника = "Педагог";
	ПараметрыОбновления.ИмяОбъекта = "Должность";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = Справочники.Должности.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();
	
	Если ПараметрыОбновления.ОбновитьНаборХарактеристик Тогда
		ПараметрыОбновления.ПроверяемыеКонстанты.Добавить("РаботаВОбразовательномУчреждении");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли