#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Ссылка") Тогда
		Параметры.Отбор.Вставить("Ссылка", ДоступныеВидыОпераций());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ДоступныеВидыОпераций() Экспорт
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.КадровыйПеревод);
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ВступлениеВДолжность);
	ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ОсвобождениеОтДолжности);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву") Тогда
		ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ПереводСПризываНаКонтракт);
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьРасчетДенежногоДовольствияВоеннослужащих") Тогда
		ВидыОпераций.Добавить(Перечисления.ВидыКадровыхОперацийВоеннослужащих.ПереводСтажераНаКонтракт);
	КонецЕсли; 
	
	Возврат ВидыОпераций;
	
КонецФункции

#КонецОбласти
