
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ГосударственнаяСлужбаВызовСервера.ОтношениеНачисленийКДенежномуДовольствиюОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеЗначения() Экспорт
	
	ДоступныеЗначения = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоДовольствияВоеннослужащих") Тогда
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоВоинскойДолжности);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоВоинскомуЗванию);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаВыслугуЛет);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаКласснуюКвалификацию);
	Иначе
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ДолжностнойОклад);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоСпециальномуЗванию);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаСтажСлужбы);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаКвалификационноеЗвание);
	КонецЕсли;
	
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаСекретность);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаОсобыеУсловияСлужбы);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ПремияЗаДобросовестноеВыполнениеСлужебныхОбязанностей);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ПрочиеВыплаты);   
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли