
#Область СлужебныеПроцедурыИФункции

Процедура РедактироватьВоинскоеСпециальноеЗвание(Форма, Сотрудник, ДатаПрисвоения = '00010101', ВоинскоеСпециальноеЗвание = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", Сотрудник);
	ПараметрыОткрытия.Вставить("ДатаПрисвоения", ДатаПрисвоения);
	ПараметрыОткрытия.Вставить("ВоинскоеСпециальноеЗвание", ВоинскоеСпециальноеЗвание);
			
	ОткрытьФорму("ОбщаяФорма.РедактированиеВоинскогоСпециальногоЗванияФизическогоЛица", ПараметрыОткрытия, Форма);	
	
КонецПроцедуры

#КонецОбласти
