#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащих Тогда
		ЭтотОбъект[0].РазрешеноСовместительствоВоеннослужащимПоКонтракту = Ложь;
	Иначе
		ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву = Ложь;
	КонецЕсли;
	
	ЭтотОбъект[0].НеИспользоватьРасчетДенежногоДовольствияВоеннослужащих = Не ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащих;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	РасчетДенежногоДовольствия.УстановитьЗависимыеНастройкиИспользоватьРасчетДенежногоДовольствияВоеннослужащих(ЭтотОбъект, Отказ);
	РасчетДенежногоСодержания.УстановитьНастройкуИспользоватьРасчетСохраняемогоДенежногоСодержания(ЭтотОбъект);
	
	// Подключаемые Характеристики
	ИсточникиХарактеристик = Новый Массив;
	ИсточникиХарактеристик.Добавить("СвойстваДолжностейГосударственнойСлужбы");
	ИсточникиХарактеристик.Добавить("СвойстваНачисленийГосударственныхСлужащих");
	ИсточникиХарактеристик.Добавить("СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов");
	ПодключаемыеХарактеристикиЗарплатаКадры.ОбновитьНаборыПодключаемыхХарактеристик(Истина, ИсточникиХарактеристик);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
