////////////////////////////////////////////////////////////////////////////////
// Подсистема "Перенос данных из E-Staff Рекрутер".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет дополнить состав имен свойств вакансии из файла, необходимых при ее загрузке.
//
// Параметры:
//	ИменаСвойств - Строка - имена свойств вакансии, разделенные запятой.
//
Процедура ПриОпределенииИменСвойствВакансии(ИменаСвойств) Экспорт
	
КонецПроцедуры

// Позволяет дополнить состав имен свойств кандидата из файла, необходимых при его загрузке.
//
// Параметры:
//	ИменаСвойств - Строка - имена свойств кандидата, разделенные запятой.
//
Процедура ПриОпределенииИменСвойствКандидата(ИменаСвойств) Экспорт
		
КонецПроцедуры

#КонецОбласти
